content/sobre.org
#+TITLE: Sobre mim
#+DESCRIPTION: Uma pequena introdução.
#+OPTIONS: toc:nil

Olá, internauta! Tudo bem com você? Eu espero que sim!

Você pode me chamar de Tukain (ou Ventriloquo, se preferir).

Eu sou um cara que gosta e muito do mundo open-source e Linux, apesar que nos
últimos tempos eu tenha perdido um pouco do vapor sobre esses assuntos. Ainda
assim, eles são importantes o bastante para ainda me importar!

-----

Atualmente estou estudando programação, com um foco maior em programação com
linguagens low-level como a C ou [[https://harelang.org][Hare]].

Mesmo assim, eu também estudo (de forma esporática) linguagens como o
[[https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQhUonl9lXZF_k1MdKRdY5XpNvPJYSNjfTvBw&s][JavaScript]] e shell-scripts. E claro, também gosto de criar sites.

Sou um usuário Linux a cerca de 5 anos, porém só comecei a me aprofundar nesse
mundo a +/- 2 anos. Hoje em dia eu uso um setup do [[https://xfce.org][XFCE]]
com o tema [[https://github.com/grassmunk/Chicago95][Chicago95]] no
[[https://alpinelinux.org][Alpine Linux]].

-----

Além desses interesses em tecnologia, eu também gosto de animes e músicas no
estilo Lo-Fi e [[https://businesscasual87.bandcamp.com/album/sails][Future Funk]].
