public/sobre.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
<!-- 2025-07-06 Sun 00:14 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sobre mim</title>
<meta name="description" content="Uma pequena introdução." />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/svg+xml" href="data:image/svg+xml,&lt;svg xmlns='http://www.w3.org/2000/svg'
	              width='32' height='32'&gt;
	              &lt;polygon points='16,2 30,16 16,30 2,16' fill='%23FFDD33'/&gt;
                      &lt;/svg&gt;">
                     <link rel=icon type="image/webp" href="/fav.webp">
                     <link rel=stylesheet href="/reset.css" />
                     <link rel=stylesheet href="/styles.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
         <nav>
           <div>
             <a href="/">Início</a>
           </div>
           <div>
             <a href="/blog.html">Blog</a>
             <a href="/sobre.html">Sobre</a>
           </div>
         </nav>
       </header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Sobre mim</h1>
</header><p>
Olá, internauta! Tudo bem com você? Eu espero que sim!
</p>

<p>
Você pode me chamar de Tukain (ou Ventriloquo, se preferir).
</p>

<p>
Eu sou um cara que gosta e muito do mundo open-source e Linux, apesar que nos
últimos tempos eu tenha perdido um pouco do vapor sobre esses assuntos. Ainda
assim, eles são importantes o bastante para ainda me importar!
</p>

<hr>

<p>
Atualmente estou estudando programação, com um foco maior em programação com
linguagens low-level como a C ou <a href="https://harelang.org">Hare</a>.
</p>

<p>
Mesmo assim, eu também estudo (de forma esporática) linguagens como o
<a href="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQhUonl9lXZF_k1MdKRdY5XpNvPJYSNjfTvBw&amp;s">JavaScript</a> e shell-scripts. E claro, também gosto de criar sites.
</p>

<p>
Sou um usuário Linux a cerca de 5 anos, porém só comecei a me aprofundar nesse
mundo a +/- 2 anos. Hoje em dia eu uso um setup do <a href="https://xfce.org">XFCE</a>
com o tema <a href="https://github.com/grassmunk/Chicago95">Chicago95</a> no
<a href="https://alpinelinux.org">Alpine Linux</a>.
</p>

<hr>

<p>
Além desses interesses em tecnologia, eu também gosto de animes e músicas no
estilo Lo-Fi e <a href="https://businesscasual87.bandcamp.com/album/sails">Future Funk</a>.
</p>
</div>
</body>
</html>
